module.exports = {
    welcome: `👋 **مرحباً بك في عائلتنا!**\n\n⚙️ صُمم هذا البوت باحترافية عالية ليمنحك تجربة فريدة من نوعها، حيث يضمن لك:\n⚡️ **سرعة قصوى** في عمليات الإيداع.\n🔄 **مرونة وأمان** فائق في السحب.\n\n🎛️ _تفضل بالاختيار من القائمة أدناه بحسب الزر الذي يلبي طلبك:_`,
    
    syriatelDeposit: (code) => `🔴 **إيداع عبر Syriatel Cash:**\n\n📲 يرجى تحويل المبلغ المراد شحنه إلى كود سيرياتيل كاش التالي:\n📥 **كود المحفظة:** \`${code}\`\n\n🛑 _بعد إتمام التحويل بنجاح، يرجى كتابة وإرسال **رقم العملية** المكون من أرقام في رسالة هنا للتحقق_ 👇`,
    
    shamDeposit: (wallet) => `🔵 **إيداع عبر Sham Cash:**\n\n📲 يرجى تحويل المبلغ المراد شحنه إلى عنوان المحفظة التالي:\n📥 **رقم المحفظة:** \`${wallet}\`\n\n🛑 _بعد إتمام التحويل بنجاح، يرجى كتابة وإرسال **رقم العملية (أو إشعار التحويل)** هنا للتحقق_ 👇`
};
